chore: add mermaid
